# Different ways to create Pandas Dataframe

### What is DataFrame?
Pandas DataFrame is a 2-dimensional labeled data structure with columns of different types.

# Method 1

### Creating Pandas DataFrame from lists of lists.

In [1]:
import pandas as pd

In [2]:
lst = [['Faiz', 22],['sachin', 20], ['Ayesh', 18], ['Kamini', 17]]
df = pd.DataFrame(lst, columns=("Name", "age"))
df

     Name  age
0    Faiz   22
1  sachin   20
2   Ayesh   18
3  Kamini   17

In [3]:
lst = [['Faiz', 22], ['sachin', 20], ['Ayesh', 18], ['Kamini', 17]]
id = ["Ab002", "Ac003", "Ad004", "Ae005"]
df1 = pd.DataFrame(lst, columns=("S_name", "S_age"), index=id)
df1

       S_name  S_age
Ab002    Faiz     22
Ac003  sachin     20
Ad004   Ayesh     18
Ae005  Kamini     17

# Method 2

### Creating DataFrame from dict of narray/lists

In [4]:
data = {'Name':['Faiz', 'Sachin', 'Ayesha', 'Kamini'],
        'Age':[22, 20, 18, 17]}
roll_No = ['Ab002', 'Ac003', 'Ad004', 'Ae005']
d = pd.DataFrame(data, index=roll_No)
d

         Name  Age
Ab002    Faiz   22
Ac003  Sachin   20
Ad004  Ayesha   18
Ae005  Kamini   17

# Method 3

### Creating Dataframe from list of dicts

In [5]:
data = [{'Name':'Faiz', 'Age': 22},
        {'Name':'Sachin', 'Age': 20},
        {'Name':'Ayesha', 'Age': 18},
        {'Name':'Kamini', 'Age': 17}]
roll_No = ['Ab002', 'Ac003', 'Ad004', 'Ae005' ]

df = pd.DataFrame(data, index=roll_No)
df

         Name  Age
Ab002    Faiz   22
Ac003  Sachin   20
Ad004  Ayesha   18
Ae005  Kamini   17

# Method 4

### Creating DataFrame using zip() function.

In [6]:
Name = ['Faiz', 'Sachin', 'Ayesha', 'Kamini']
Age = [22, 20, 18, 17]
roll_No = ['Ab002', 'Ac003', 'Ad004', 'Ae005' ]

lst_tuple = list(zip(Name, Age))

df = pd.DataFrame(lst_tuple, index=roll_No, columns=("S_name", "S_age"))

df

       S_name  S_age
Ab002    Faiz     22
Ac003  Sachin     20
Ad004  Ayesha     18
Ae005  Kamini     17

# Method 5

### Creating DataFrame from series.

### Pandas Series is a one-dimensional labeled array capable of holding data of any type

In [9]:
Name = pd.Series(['Faiz', 'Sachin', 'Ayesha', 'Kamini'])
Age = pd.Series([22, 20, 18, 17])

data = {'s_name':Name, 's_age': Age}

df = pd.DataFrame(data)
df

   s_name  s_age
0    Faiz     22
1  Sachin     20
2  Ayesha     18
3  Kamini     17